 (function(){var replaceText = function(node){
  var all = [];
  for (node=node.firstChild;node;node=node.nextSibling){
  if (node.nodeType==3) node.nodeValue=node.nodeValue.replace(/[ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔゕゖァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ一乙七丁九了二人入八刀力十又下三上丈万与丸久及乞亡凡刃千口土士夕大女子寸小山川工己巾干弓才不中丹乏予井五互介今仁仏元公六円内冗凶刈切分勾匂化区匹午升厄収双反友太天夫孔少尺屯幻引弔心戸手支文斗斤方日月木欠止比毛氏水火爪父片牛犬王且丘世丙主丼以仕仙他代付令兄冊写冬凹出凸刊加功包北半占去右可句古号司史叱召台四囚圧処外央失奴尻尼巨巧左市布平幼広庁弁必打払斥旧旦札本末未正母民永汁氾氷牙犯玄玉瓦甘生用甲申田由白皮皿目矛矢石示礼穴立込辺再両州交仮会企伎休仰件仲伝任伐伏光充先兆全共刑列劣匠印危各吉吸叫向后合吐同名吏因回団在地多好如妃妄字存安宇守宅寺当尽巡帆年式忙成扱旨旬早曲有机朽朱朴次死毎気汚汗江池汎灰灯争壮百竹米糸缶羊羽考老耳肉肌自至臼舌舟色芋芝虫血行衣西弐迅串乱亜位何佐作伺似住伸体但低伯伴余克児兵冶冷初判別利助努励労医却即卵含吟君呉告吹呈否呂囲困図均坑坂坊壱声売妥妊妨妙妖孝完寿対局尿尾岐攻改希序床廷弟形役応快忌志忍忘我戒戻技抗抄折択投把抜批扶抑更材条杉束村来沖汽求決沙汰沢沈没沃災狂状弄男町社私秀究系肝肖肘臣良花芸芯芳見角言谷豆貝赤走足身車辛近迎返那邦里阪防麦並乳事享京依価佳供使侍舎侮併例免具典券刻刷刺制到刹劾効協卒卓参取受叔呼呪周味命和固国垂坪夜奇奈奉奔委妻始姉姓妬妹学季宛官宜実宗宙定宝尚居屈届岡岳岸岩岬幸底店府延弦弥往径征彼怪性忠念怖所房押拐拡拒拠拘承招拙拓担抽抵拝拍披抱抹拉放易旺昆昇昔明服果枝松枢析東杯板枚枕林枠欧武歩殴毒泳沿河泣況治沼注泥波泊泌沸法泡油炎炊炉采版邪物牧狙玩画的直盲知祈祉空突者育肩股肯肢肥肪英苛芽苦茎若苗茂虎表述迭迫邸金長門阻阜附雨青非斉乗眉亭係侯俊信侵促俗便保侶冠削前則勅勃勇南卑卸厚厘叙哀咽咲単品垣型城変契奏威姻姿孤客室宣専封屋峡峠巻帥帝幽度建弧後待律怨悔急恒恨思怠怒括挟拷拶指持拾拭挑故政施映昨春昭是星昼昧栄架柿枯査柵柔染柱栃柄某柳段海活洪浄泉浅洗津洞派洋炭点為牲狭狩独珍甚畏界畑疫発皆皇盆看県盾省相冒研砂砕祝神祖科秋秒窃紀級糾紅約美耐胃胎胆背肺胞臭茨荒草荘茶虐虹要計訂訃貞負赴軌軍逆送退追逃迷郊郎重限面革音風飛食首香俺倹個候借修倉値倒俳倍俵倣俸倫党兼冥准凄凍帰剣剛剤剥剖勉匿原員唄唆唇哲唐哺埋夏娯娠姫娘孫宴家害宮宰宵容射将展島峰差師席帯庫座庭弱従徐徒悦恩恐恭恵悟息恥悩恋恣扇挨挙拳挫振捜挿捉捗捕敏料旅既時書朕朗案格核株桑桁校根栽桜桟栓桃梅残殊殉殺浦酒消浸泰浜浮浴流涙浪烈特珠班畝畜畔留疾症疲病益真眠破砲祥称租秩秘笑粋粉索紙純素納紛紡紋翁耕耗胸脅脂脊胴能脈脇致航般荷華蚊蚕衰袖衷被記訓託討貢財起軒辱逝造速逐通逓途透連郡酌酎配釜針院陥降除陣陛隻飢馬骨高鬼竜爽乾偽偶健側停偵偏曽剰副勘動務頃喝啓商唱唾問唯域基埼執堆堂培堀婚婆婦寄寂宿密尉崖崎崇崩常帳康庶庸強張彩彫得悪患惨情惜悼悠惧戚掛掘掲控採捨授推据接措掃探捻排描救教敗斜斬断旋族曹望械梗巣梨欲殻淫液涯渇渓混済渋淑渉深清淡添涼猫猛猟率球現理瓶産異略痕盛盗眼眺祭票移窓窒章第笛符粗粘粒経紺細終紹紳組累羞習翌粛脚脱脳舷船舶萎菓葛菊菌菜著虚蛍蛇術袋規視許訟設訪訳豚貨貫責販貧貪赦転軟逸週進逮郭郷都部郵酔釈野釣閉陰険陳陶陪陸隆陵雪頂魚鳥鹿麻黄黒斎亀偉僅傘備傍割創勤勝募博喚喜喫喉善喪喩圏堪堅場堕塚堤塔塀報塁奥媒媛婿寒富尋尊営就属嵐順幅帽幾廃廊弾須御循復慌惰悲愉惑扉握援換揮掌提搭揚揺敢敬散斑暁景暑晶晴晩普最替期朝椅棺棋検植森棚椎棟棒款欺殖渦温減湖港滋湿測渡湯満湧湾煮焼焦然無猶琴畳番疎痩痛痘痢登短硬硝硫税程童筋策等答筒筆粧絵給結絞紫絶統絡着腕葬葉落蛮衆街裁装補裕裂覚詠詐詞証詔診訴評象賀貴貸貯貼買費貿越超距軽軸運過遇遂達遅道遍遊酢量鈍開間閑階隅随隊陽雇集雄雲雰項飲飯歯傾傑債催傷僧働傲煎勧勢嗣嘆嗅園塩塊塞塑塗墓夢奨嫁嫌嫉寛寝幕幹廉彙微愛意慨感愚慈愁慎想慄戦携搾摂損搬数新暗暇暖楽棄業極楼楷歳殿毀滑漢源溝準滞滝溺漠滅溶煙照煩猿献痴盟睡督睦碁禍禁禅福稚窟節継絹続罪署置義群羨聖腰腫腎腺腸腹艇蓋蒸蓄虞虜蜂褐裾裸裏解触該詰詣誇詩試詳誠詮誉話豊資賊賃賂賄跡践跳路較載辞農違遠遣遡遜酬酪鉛鉱鉄鉢鈴隔隙雅電雷零靴頑頓頒預飼飾飽鼓像僕僚疑鳴境塾増墨奪嫡寡察寧蜜層彰徴徳慣憎態慕慢摘旗暮暦概構模様歌歴演漁漆漸漬滴漂漫漏熊獄瑠瘍磁碑稲穀種端箇管算箋精維綱緒総綻綿網緑練罰聞腐膜蔑製複語誤誌誓説読認誘豪貌踊辣遮遭適酵酷酸銀銃銭銅銘閣関閥隠際障雑雌需静領餌餅駅駆駄髪魂鼻億儀舗劇勲器嘱噴嘲墜墳審寮導履幣畿弊影徹慰慶憧憤憂慮憬戯撃撮撤撲摩摯敵敷暫暴横権槽標歓潟潔潤澄潜潮潰熟熱璃監盤確稼稿穂窮窯箱箸範縁緩緊線締縄編罵罷膝膚舞蔵蔽衝褒謁課諸請諾誰誕談調論賛賜質賞賭賠賓賦趣踏踪輝輩輪遺遵選遷鋭鋳閲震霊餓養駒駐魅黙儒凝壊墾壌壇壁奮嬢憶懐憾憩憲操擁整曇機橋樹激濁濃燃獲獣磨穏稽積築篤糖緯縦縛繁縫緻膳膨興薫薪薦薄薬融衛衡親諮諦謎謀諭謡諧賢頼輸還避醒錦鋼錯錠錬録錮隣隷頭館骸麺償優嚇厳懇戴擬擦曖濯燥爵犠環療瞳瞭矯礁縮績繊翼聴臆覧謹謙講謝謄購轄醜鍵鍛鍋闇霜頻鮮齢懲曜濫璧癖癒瞬礎穫簡糧織繕繭翻職臨藤藩藍襟覆観贈鎌鎖鎮闘難韓額顎顔顕題類騎験騒瀬爆璽簿繰羅臓艶藻覇警識譜蹴鏡離霧韻願髄鯨鶏麗麓懸欄競籍議護譲醸鐘響騰艦躍露顧魔鶴籠襲驚鑑鬱嘘]+/g,"");
  replaceText(node);
  }
  };
  replaceText(document.body);
  
  
  chrome.runtime.onMessage.addListener
 (function(request, sender, sendResponse) {
  if( request.message === "clicked_browser_action" ) {
  var firstHref = $("a[href^='http']").eq(0).attr("href");
  
  console.log(firstHref);
  }
  }
  );
  
  /*chrome.extension.onMessage.addListener(
                                         function(request, sender, sendResponse) {
                                         alert("hi");
                                         if (request.redoReplaceText)
                                         alert("hello background");
                                         }
                                         );*/
  }());
